الوحدة.الصادرات = {
    الاسم:"مشرفين",
    الاسم المستعار: ["منشن المشرفين"،"]"],
    تنازلي: "منشن جميع مشرفين المجموعه.",
    الفئة:""",
    الاستخدام:"message <رسالتك>",
    رد:"🍁",
    البداية: غير متزامن (
      ميكو,
      m,
      { النص ، البادئة ، إيسادمين ، المشاركين، أرجس ، غروبادمين}
    ) => {

    السماح رسالة = "" * مدراء الاهتمام* "";

    إذا (م. نقلت) {
        رسالة = "" * مدراء الاهتمام* "";
      }
    آخر إذا (!نص & & م. مقتبس) {
      رسالة = ' {{م.نقلت ? م.نقلت.جي اس :"} `;
    }
    آخر إذا (أرجس[0]){
      رسالة = ` "* مدراء الاهتمام* " \ن \ ن_ Message رسالة: _ *{{وسائط.انضم ('')} * `;
    }
    آخر إذا (نص===") {
      رسالة = "" * مدراء الاهتمام* "";
    }
   
    آخر{
      رسالة = "" * مدراء الاهتمام* "";
    }
    
        (ميكو).إرسال رسالة (م. من ، { نص: رسالة ، يذكر: مدير المجموعة} ، { مقتبس: م });
    }
}
