كونست النمس = تتطلب ("النمس");
تتطلب ("../../ التكوين.شبيبة");
تتطلب ("../../ الأساسية.شبيبة");
كونست { عضو الكنيست } = تتطلب ("../../ قاعدة البيانات / مخطط البيانات.شبيبة");



الوحدة.الصادرات = {
    الاسم:"منع الروابط",
    الاسم المستعار: ["ألينكجك"، "أنتيلينك"],
    تنازل: "تمكين أو تعطيل ميزة أنتيلينك في مجموعة",
    الفئة:"مجموعة",
    الاستعمال:" [[[/]]",
    رد:"🔒",
    البداية: غير متزامن (
      ميكو,
      m,
      { أرغس ، إيسبوتادمين ، إيسادمين ، إيسكريتور ، الرد ، البادئة ، بوشنام }
    ) => {
        إذا (!إيسادمين&&!إسبوتادمين)
        عودة ميكو.إرسال رسالة(
          م. من,
          {
            النص: 'بوت و * {{دفع اسم}* 
يجب أن يكون كلاهما مشرفا لاستخدام هذا الأمر !`,
          },
          { مقتبس: م }
        );
  
      دعونا تشيكداتا = تنتظر عضو الكنيست.فيندون ({ معرف: م. من });
      فار جروب = تنتظر ميكو.مجموعةميتاداتا (م. من عند);
      أعضاء فار = مجموعة ["المشاركون"];
      فار ممس = [];
      الأعضاء.خريطة (غير متزامن (أدم) = > {
        دفع (أدم. معرف. استبدال("c.us" ، "s.whatsapp.net"));
      });
  
      إذا (أرجس [0] = = = "على") {
        إذا (!التحقق من البيانات) {
          انتظر عضو الكنيست الجديد ({معرف: م.من ، أنتيلينك: "صحيح" }).حفظ();
          (ميكو).إرسال رسالة(
            م. من,
            {
              النص ` ` \ ` \ `\` " تحذير "\`\ ' \ ' \ن \ نانتيلينك النظام تفعيلها!`,
              معلومات السياق: { مذكورة: ممس },
            },
            { مقتبس: م }
          );
          عودة ميكو.إرسال رسالة(
            م. من,
            { نص: `*
تم تفعيل منع الروابط بنجاح*` },
            { مقتبس: م }
          );
        } آخر {
          إذا (تحقق من البيانات.أنتيلينك = = "صحيح")
            عودة ميكو.إرسال رسالة(
                م. من,
                {نص ` ' *متفعل بالفعل*` },
                { مقتبس: م }
              );
          انتظر عضو الكنيست.تحديث واحد ({ معرف: م. من} ، { أنتيلينك: "صحيح"});
          عودة ميكو.إرسال رسالة(
            م. من,
            {نص ` ' *منع الروابط ممنوع في هذه المجموعه*` },
            { مقتبس: م }
          );
        }
      } آخر إذا (أرجس [0] = = = "إيقاف") {
        إذا (!التحقق من البيانات) {
          انتظر عضو الكنيست الجديد ({معرف: م.من ، أنتيلينك: "خطأ" }).حفظ();
          عودة ميكو.إرسال رسالة(
            م. من,
            { نص ` ' * تم إلغاء تنشيط الرابط الأنتيلينك بنجاح*'},
            { مقتبس: م }
          );
        } آخر {
          إذا (تحقق من البيانات.أنتيلينك == "كاذبة") العودة ميكو.إرسال رسالة(
            م. من,
            { نص ` ' * تم إلغاء تنشيطه بالفعل.*` },
            { مقتبس: م }
          );
          انتظر عضو الكنيست.تحديث واحد ({ معرف: م. من} ، { أنتيلينك: "خطأ"});
          عودة ميكو.إرسال رسالة(
            م. من,
            {نص ` ' *منع الروابط ممنوع في هذه المجموعه*` },
            { مقتبس: م }
          );
        }
      } آخر {
        دعونا أزرارنتيلينك = [
          {
            بوتونيد ``{{بادئة}أنتيلينكغ على',
            زر النص: { عرض النص: "على"},
            النوع: 1,
          },
          {
            بوتونيد:`{{بادئة}أنتيلينكغك قبالة',
            زر النص: { عرض النص: "إيقاف"},
            النوع: 1,
          },
        ];
        دعونا بمفغ = {
          صورة: {رابط: بوتيماجي 6} ,
          التسمية التوضيحية ` '\ ن * "تكوين مجموعة ألتيلينك" * \ن \ ن يرجى النقر على الزر أدناه \ ن * تشغيل / إيقاف * \ ن`,
          تذييل الصفحة ` ' *{{بوتنام}*`,
          أزرار: أزرارنتيلينك,
          نوع الرأس: 4,
        };
        انتظر ميكو.إرسال رسالة (م. من ، بمفغ ، { مقتبس: م });
    }
  },
};
