كونست خ = تتطلب ("خ");
كونست جيمب = تتطلب ("جيمب");
تتطلب ("../../ الأساسية.شبيبة");

الوحدة.الصادرات = {
  الاسم:"تعيين اسم المجموعة",
  الاسم المستعار: ["سيتناميغك" ، "تشانغيغكنام"، "سيتغروبنام"، "تشانغيغروبنام"],
  تنازلي:""",
  الفئة:""",
  الاستعمال ` ' سيتغكنام <اسم المجموعة الجديدة>`,
  رد:"🍁",
  البداية: غير متزامن (
    ميكو,
    m,
    { نص ، بادئة ، إسبوتادمين ، إيسادمين ، بوشنام ، الفوقية، أرجس ، مايم }
  ) => {
    إذا (!إيسادمين&&!إسبوتادمين)
        عودة ميكو.إرسال رسالة (م. من ، {نص ` ' * بوت *و * {{اسم الدفع} * يجب أن يكون كلاهما * مشرف * من أجل استخدام هذا الأمر!'} ، {مقتبس: م });
    إذا (![0])
        عودة ميكو.إرسال رسالة (م. من عند, {نص: 'يرجى تقديم اسم مجموعة جديد !'} ، {مقتبس: م });
    
    فار نيوغكنام = أرجس.انضم ("");
    فار أولدغكنام = الفوقية.الموضوع;

    محاولة {
        في انتظار ميكو . بروفيلبيكتوريورل (م. من ، "صورة");
      } قبض {
        بجك = "https://wallpapercave.com/wp/wp10524580.jpg";
      }

    انتظر ميكو.غروبوبداتيسوبجيكت (م. من ، نيوغكنام).ثم ((الدقة) => ميكو.إرسال رسالة(
        م. من,
        {
          صورة: { رابط: بغك ، ميميتيب: "صورة/جبيغ"},
          التسمية التوضيحية ` ' *"تم تغيير اسم المجموعة" *\ن\ن_Name الاسم القديم:_\ن*{{الاسم القديم}*\ن\ن Name الاسم الجديد: _ \ن * {{الحجج.انضم ("")} * `,
        },
        { مقتبس: م }
      )).الصيد ((خطأ) = > إعادة (جسونفورمات (خطأ)))
    
  },
};
