كونست النمس = تتطلب ("النمس");
تتطلب ("../../ التكوين.شبيبة");
تتطلب ("../../ الأساسية.شبيبة");
كونست { عضو الكنيست } = تتطلب ("../../ قاعدة البيانات / مخطط البيانات.شبيبة");



الوحدة.الصادرات = {
    الاسم:"الرد الالي",
    الاسم المستعار: ["الدردشة التلقائية"، "الرد التلقائي" ، "مجموعة الدردشة الآلية"],
    تنازل: "تمكين أو تعطيل ميزة الرد التلقائي في مجموعة",
    الفئة:"مجموعة",
    الاستعمال:" [[[/]]",
    رد:"🎀",
    البداية: غير متزامن (
      ميكو,
      m,
      { أرغس ، إيسبوتادمين ، إيسادمين ، إيسكريتور ، الرد ، البادئة ، بوشنام }
    ) => {
      
        إذا (!إيسادمين)
        عودة ميكو.إرسال رسالة(
          م. من,
          {
            النص ` ' *{{دفع اسم}*!يجب أن يكون *مشرفا* لتمكين الرد الالي`,
          },
          { مقتبس: م }
        );
  
      دعونا تشيكداتا = تنتظر عضو الكنيست.فيندون ({ معرف: م. من });
      فار جروب = تنتظر ميكو.مجموعةميتاداتا (م. من عند);
      أعضاء فار = مجموعة ["المشاركون"];
      فار ممس = [];
      الأعضاء.خريطة (غير متزامن (أدم) = > {
        دفع (أدم. معرف. استبدال("c.us" ، "s.whatsapp.net"));
      });
  
      إذا (أرجس [0] = = = "على") {
        إذا (!التحقق من البيانات) {
          انتظر عضو الكنيست الجديد ({المعرف: م.من ، روبوت الدردشة: "صحيح" }).حفظ();
          (ميكو).إرسال رسالة(
            م. من,
            {
              نص ` ' * تم تنشيط روبوت الدردشة الجماعي! * \ن \ نتو استخدامه أذكر رسالة بوت مع رسالتك.`,
              معلومات السياق: { مذكورة: ممس },
            },
            { مقتبس: م }
          );
          عودة ميكو.إرسال رسالة(
            م. من,
            { نص ` ' * تم تنشيط روبوت الدردشة الجماعي !* \ن \ نتو استخدامه أذكر رسالة بوت مع رسالتك.` },
            { مقتبس: م }
          );
        } آخر {
          إذا (تحقق من البيانات.روبوت الدردشة = = "صحيح")
            عودة ميكو.إرسال رسالة(
                م. من,
                { النص ` ' * تنشيط بالفعل.* \ن \ نتو استخدامه أذكر رسالة بوت مع رسالتك.` },
                { مقتبس: م }
              );
          انتظر عضو الكنيست.أوبداتيوني ({ إد: م. من } ، { تشاتبوت: "صحيح"});
          عودة ميكو.إرسال رسالة(
            م. من,
            { نص ` ' * تم تنشيط روبوت الدردشة الجماعي !*` },
            { مقتبس: م }
          );
        }
      } آخر إذا (أرجس [0] = = = "إيقاف") {
        إذا (!التحقق من البيانات) {
          انتظر عضو الكنيست الجديد ({المعرف: م.من ، روبوت الدردشة: "خطأ" }).حفظ();
          عودة ميكو.إرسال رسالة(
            م. من,
            { نص ` ' * تم إلغاء تنشيط روبوت الدردشة الجماعي!*` },
            { مقتبس: م }
          );
        } آخر {
          إذا (تحقق من البيانات.تشاتبوت == "كاذبة") العودة ميكو.إرسال رسالة(
            م. من,
            { نص ` ' * تم إلغاء تنشيطه بالفعل.*` },
            { مقتبس: م }
          );
          انتظر عضو الكنيست.أوبداتيوني({ إد: م. من } ، { تشاتبوت: "كاذبة"});
          عودة ميكو.إرسال رسالة(
            م. من,
            { نص ` ' * تم إلغاء تنشيط روبوت الدردشة الجماعي !*` },
            { مقتبس: م }
          );
        }
      } آخر {
        دعونا أزرارنتيلينك = [
          {
            بوتونيد: `{{بادئة}تشاتبوت على`,
            زر النص: { عرض النص: "على"},
            النوع: 1,
          },
          {
            بوتونيد:`prefix {بادئة}شات بوتغك قبالة',
            زر النص: { عرض النص: "إيقاف"},
            النوع: 1,
          },
        ];
        دعونا بمفغ = {
          صورة: {رابط: بوتيماجي 4} ,
          التسمية التوضيحية ` '\ ن * " تكوين روبوت الدردشة الجماعي "*\ن\ن يرجى النقر فوق الزر أدناه\ن*تشغيل / إيقاف * \ ن`,
          تذييل الصفحة ` ' *{{بوتنام}*`,
          أزرار: أزرارنتيلينك,
          نوع الرأس: 4,
        };
        انتظر ميكو.إرسال رسالة (م. من ، بمفغ ، { مقتبس: م });
    }
  },
};
