تتطلب ("../../ التكوين.شبيبة");
تتطلب ("../../ الأساسية.شبيبة");

الوحدة.الصادرات = {
  الاسم:"تخفيض",
  الاسم المستعار: ["ماركا"],
  تنازلي: "تخفيض رتبة عضو",
  الفئة:"مجموعة",
  الاستعمال:"تخفيض @المستخدم",
  رد:"🍁",
  البداية: غير متزامن (
    ميكو,
    m,
    { نص ، بادئة ، إسبوتادمين ، إيسادمين ، ذكربيتاغ ، بوشنام ، جروبادمين}
  ) =>{
    إذا (!إيسادمين) {
      عودة ميكو.إرسال رسالة(
        م. من,
        {نص ` ' {{فوضى.المستخدم}'},
        { مقتبس: م }
      );
    }
  //
    إذا (!نص&&!م. نقلت) {
      عودة ميكو.إرسال رسالة(
        م. من,
        { النص: 'يرجى وضع علامة على المستخدم إلى * تخفيض*!` },
        { مقتبس: م }
      );
    } آخر إذا (م. نقلت) {
      فار المذكورةالمستخدم = م.نقلت.المرسل;
    } آخر {
      فار المذكورةالمستخدم = ذكربيتاغ [0];
    }

    دعونا معرف المستخدم = (في انتظار المذكورالمستخدم) / / م.جي اس.معلومات السياق.مشارك;
    إذا (!مدير المجموعة.يشمل (معرف المستخدم)) {
      عودة ميكو.إرسال رسالة(
        م. من,
        {نص:' @{{
          ذكر المستخدم.انقسام ( " @") [0]
        } سينباي ليس * المشرف*!'،يذكر: [ذكر المستخدم]،},
        { مقتبس: م }
      );
    }

    محاولة {
      انتظر ميكو.مجموعةالمشاركونتحديث (م. من ، [معرف المستخدم] ، "تخفيض").ثم(
        (الدقة) =>
          (ميكو).إرسال رسالة(
            م. من,
            {
              النص: 'آسف @{{
                ذكر المستخدم.انقسام ( " @") [0]
              } سينباي ، لقد تم * تخفيض * من قبل * المشرف*!`,
              يذكر: [ذكر المستخدم],
            },
            { مقتبس: م }
          )
      );
    } الصيد (خطأ) {
       (ميكو).إرسال رسالة(
        م. من,
        {نص ` ' {{فوضى.بوتادمين}'},
        { مقتبس: م }
      ); 
    }
    
  },
}; 
