الوحدة.الصادرات = {
    الاسم: "المجموعة",
    الاسم المستعار: ["غ" ، "المجموعة المفتوحة"],
    تنازلي: "تعيين صورة ملف تعريف المجموعة.",
    الفئة:"مجموعة",
    الاستعمال ` ' علامة صورة ونوع-سيتبجك}`,
    رد:"🍁",
    البداية: غير متزامن (
      ميكو,
      m,
      { نص ، بادئة ، إسبوتادمين ، إيسادمين ، ذكربيتاغ ، أرجس ، بوشنام، مايم ، ونقلت }
    ) => {
        إذا (!إيسادمين&&!إسبوتادمين)
        عودة ميكو.إرسال رسالة(
          م. من,
          {
            * يجب أن يكون كلاهما مشرفا من أجل استخدام هذا الأمر !`,
          },
          { مقتبس: م }
        );
        إذا (أرجس [0] = = = 'إغلاق') {
            انتظر ميكو.إعداد المجموعةتحديث (م. من عند, 'إعلان').ثم ((الدقة) => م.الرد` ' تم إغلاق المجموعة!`))
            } آخر إذا (أرجس [0] = = = 'فتح') {
            انتظر ميكو.تحديث المجموعة(م.من ، 'لا_إعلان').ثم ((الدقة) => م.الرد` ' تم فتح المجموعة!`))
            } آخر {
            السماح أزرار = [
            { زر: 'prefix {بادئة}مجموعة مفتوحة' ، زر النص: { عرض النص: 'فتح'} ، نوع: 1 },
            {بوتونيد: 'prefix {بادئة}إغلاق المجموعة' ، بوتونتكست: { ديسبلايتكست: 'إغلاق'} ، نوع: 1 }
            ]
            دعونا زررسالة = {
            النص ` ' * " {{عالمي.بوتنام} " * \ن \ ن_مجموعة إعداد أداة المغير_:`,
            تذييل الصفحة ` ' {{بوتنام}`,
            أزرار: أزرار,
            نوع الرأس: 4
            }
            (ميكو).إرسال رسالة (م. من ، زررسالة ، {مقتبس: م })
            }
        }
    }
