كونست لحظة = تتطلب ('لحظة-التوقيت')

الوحدة.الصادرات = {
    الاسم: "غينفو",
    الاسم المستعار: ["معلومات المجموعة"],
    تنازلي: "تغيير وصف المجموعة",
    الفئة:"مجموعة",
    استعمال ` ' سيتديسك < وصف المجموعة الجديدة>`,
    رد:"🍁",
    البداية: غير متزامن (
      ميكو,
      m,
      { نص ، بادئة ، إسبوتادمين ، إيسادمين ، بوشنام ، الفوقية، أرجس ، مايم }
    ) => {
        محاولة {
            في انتظار ميكو . بروفيلبيكتوريورل (م. من ، "صورة");
          } قبض {
            بجك = بوتيماجي 1;
          }
          المشاركين كونست = م. إيسغروب ? انتظر البيانات الوصفية.المشاركون : "
          كونست غروبادمينز = م. إيسغروب ? انتظر المشاركين.مرشح (الخامس => الخامس المشرف != = لاغية).خريطة (الخامس => v.id) : "
          كونست جروبونر = م. مجموعة ? البيانات الوصفية.المالك : "
          
          تنازلي = البيانات الوصفية.تنازلي ? البيانات الوصفية.تنازلي :' لا يوجد وصف'

          دعونا النص = ' * "معلومات المجموعة" *\ن\ن_ Name اسم المجموعة:_ * {{الفوقية.وصف المجموعة: _ \ ن {{تنازلي} \ ن \ ن _ Owner مالك المجموعة: _ @{{البيانات الوصفية.المالك.سبليت('@')[0]}\ن_ Group المجموعة التي تم إنشاؤها على: _ * {{لحظة` ' {{البيانات الوصفية.إنشاء} ' * 1000). تس ('آسيا/كولكاتا'). شكل ('يوم / مم / سنة')} * \ ن_ Total مجموع المسؤولين:_ * {{جروبادمينس.الطول} * \ ن_ Total مجموع المشاركين:_ *{{البيانات الوصفية.المشاركون.الطول} * \ ن`;
        

          انتظر ميكو.إرسال رسالة(
            م. من,
        {
          صورة: { رابط: بغك ، ميميتيب: "صورة/جبيغ"},
          شرح: النص,
          يذكر: [البيانات الوصفية.المالك]
        },
        { مقتبس: م }
      );
    }
  }
