الوحدة.الصادرات = {
  الاسم: "الترويج",
  الاسم المستعار: ["حفلة موسيقية"],
  تنازلي: "ترقية عضو",
  الفئة:"مجموعة",
  الاستعمال: "تعزيز @المستخدم",
  رد:"🍁",
  البداية: غير متزامن (
    ميكو,
    m,
    { نص ، بادئة ، إسبوتادمين ، إيسادمين ، ذكربيتاغ ، بوشنام ، جروبادمين }
  ) => {
    إذا (!إيسادمين) {
      عودة ميكو.إرسال رسالة(
        م. من,
        {نص ` ' {{فوضى.المستخدم}'},
        { مقتبس: م }
      );
    }
  //
    إذا (!نص&&!م. نقلت) {
      عودة ميكو.إرسال رسالة(
        م. من,
        { النص: 'يرجى علامة المستخدم إلى * تعزيز*!` },
        { مقتبس: م }
      );
    } آخر إذا (م. نقلت) {
      فار المذكورةالمستخدم = م.نقلت.المرسل;
    } آخر {
      فار المذكورةالمستخدم = ذكربيتاغ [0];
    }

    دعونا معرف المستخدم = (في انتظار المذكورالمستخدم) / / م.جي اس.معلومات السياق.مشارك;
    إذا (مدير المجموعة.يشمل (معرف المستخدم)) {
      عودة ميكو.إرسال رسالة(
        م. من,
        {نص:' @{{
          ذكر المستخدم.انقسام ( " @") [0]
        } سينباي هو بالفعل * المشرف*!'،يذكر: [ذكر المستخدم]،},
        { مقتبس: م }
      );
    }

    محاولة {
      انتظر ميكو.مجموعةالمشاركونالتحديث (م. من ، [معرف المستخدم] ، "الترويج").ثم(
        (الدقة) =>
          (ميكو).إرسال رسالة(
            م. من,
            {
              نص: 'مبروك @{{
                ذكر المستخدم.انقسام ( " @") [0]
              } سينباي 🥳 ، لقد تمت ترقيتك * بنجاح !`,
              يذكر: [ذكر المستخدم],
            },
            { مقتبس: م }
          )
      );
    } الصيد (خطأ) {
       (ميكو).إرسال رسالة(
        م. من,
        {نص ` ' {{فوضى.بوتادمين}'},
        { مقتبس: م }
      ); 
    }
    
  },
};
