تتطلب ("../../ التكوين.شبيبة");
تتطلب ("../../ الأساسية.شبيبة");

الوحدة.الصادرات = {
  الاسم:"إزالة",
  الاسم المستعار: ["ريم"],
  تنازلي: "إزالة عضو من المجموعة",
  الفئة:"مجموعة",
  الاستعمال: "إزالة @المستخدم",
  رد:"🍁",
  البداية: غير متزامن (
    ميكو,
    m,
    { نص ، بادئة ، إيسبوتادمين ، إيسادمين ، ذكر بيتاغ ، بوشنام}
  ) => {
    إذا (!نص&&!م. نقلت) العودة م. الرد` ' يرجى وضع علامة على المستخدم إلى * إزالة * من المجموعة!`)
    إذا (!إيسادمين) عودة ميكو.إرسال رسالة (م. من عند, { نص: فوضى.مستخدم} ، {مقتبس: م });

    إذا (!نص&&!م. نقلت) {
      عودة ميكو.إرسال رسالة(
        م. من,
        { النص: 'يرجى وضع علامة على المستخدم إلى * إزالة*!` },
        { مقتبس: م }
      );
    } آخر إذا (م. نقلت) {
      فار المذكورةالمستخدم = م.نقلت.المرسل;
    } آخر {
      فار المذكورةالمستخدم = ذكربيتاغ [0];
    }

    السماح للمستخدمين = (في انتظار المذكورةالمستخدم) / / م.جي اس.معلومات السياق.مشارك;

    محاولة {
      انتظر ميكو.مجموعةالمشاركونالتحديث (م. من ، [المستخدمون] ، "إزالة").ثم(
        (الدقة) =>
          (ميكو).إرسال رسالة(
            م. من,
            { نص ` ' تمت إزالة المستخدم * بنجاح بواسطة * {{اسم الدفع}`'},
            { مقتبس: م }
          )
      );
    } الصيد (يخطئ) {
      (ميكو).إرسال رسالة (م. من ، { نص ` ' {{فوضى.بوتادمين}'} ، {مقتبس: م });
    }
  },
};
