كونست لحظة = تتطلب ('لحظة-التوقيت')

الوحدة.الصادرات = {
    الاسم: "تقرير",
    الاسم المستعار: ["العدد"],
    تنازلي: "للإبلاغ عن مشكلة للمالك",
    بارد: 3600,
    الفئة:"مجموعة",
    استعمال ` ' تقرير < وصف المشكلة>`,
    رد:"🍁",
    البداية: غير متزامن (
      ميكو,
      m,
      { نص ، بادئة ، إسبوتادمين ، إيسادمين ، بوشنام ، الفوقية ، أرجس }
    ) => {
        إذا (!م. إيسغروب) {
            إذا (![0]) العودة م. الرد` ' يرجى تقديم رسالة للإبلاغ عن المطورين !`);
            دعونا علامة المستخدم = م. المرسل.انقسام ( " @") [0];
            دعونا نستعمل = أرجس.انضم ("");
            دع اسم المستخدم = اسم الدفع;

            محاولة {
                المستخدم = انتظر ميكو.بروفيلبيكتوريورل (م. المرسل، "صورة");
              } الصيد (ه) {
                المستخدم = بوتيماج3;
              }

            اسمحوا reportMessage = ` *" التقرير تلقي "*\n\n*👤 ذكرت من قبل:* @${userTag}\n\n*📝 الرسالة:* ${userMess}\n\n*📅 التاريخ:* ${لحظة().tz('Asia/Kolkata').شكل('DD/MM/YYYY')}\n*⏰ الوقت:* ${لحظة().tz('Asia/Kolkata').شكل('hh:mm:ss A')}\n*🍁 حرف باستخدام:* ${اسم بوت}\n\n*📌 ملاحظة: هذه رسالة تلقائية, الرجاء عدم الرد على هذه الرسالة لتجنب عرقلة.*`;
            م. الرد` ' إرسال التقرير إلى المطور الرئيسي...\ ن \ الجبهة القومية الإسلامية بل هو البريد المزعج قد تحصل * منعت * و * المحظورة*.`);
            
            دعونا المشروعات الإنمائية = [`918101187835@s.whatsapp.net`,`923045204414@s.whatsapp.net`,`918515848233@s.whatsapp.net`]

            ل (اسمحوا لي = 0; أنا < المشروعات الإنمائية.الطول ؛ أنا {) {
              انتظر ميكو.سيندمسيج (ديفس [أنا] ، {صورة: {ورل: وسيربف} ، شرح: ريبورتمسيج ، يذكر: [م. المرسل]،});
            }
        }
        آخر{
            إذا (![0]) العودة م. الرد` ' يرجى تقديم رسالة للإبلاغ عن المطورين !`);
            دعونا علامة المستخدم = م. المرسل.انقسام ( " @") [0];
            دعونا نستعمل = أرجس.انضم ("");
            دع اسم المستخدم = اسم الدفع;
            السماح غنام = البيانات الوصفية.الموضوع;

            محاولة {
                في انتظار ميكو . بروفيلبيكتوريورل (م. من ، "صورة");
              } قبض {
                بجك = بوتيماجي 3;
              }
              اسمحوا reportMessage = ` *" التقرير تلقي "*\n\n*👤 ذكرت من قبل:* @${userTag}\n*🧩 اسم المجموعة:* ${gcName}\n\n*📝 الرسالة:* ${userMess}\n\n*📅 التاريخ:* ${لحظة().tz('Asia/Kolkata').شكل('DD/MM/YYYY')}\n*⏰ الوقت:* ${لحظة().tz('Asia/Kolkata').شكل('hh:mm:ss A')}\n*🍁 حرف باستخدام:* ${اسم بوت}\n\n*📌 ملاحظة: هذه رسالة تلقائية, الرجاء عدم الرد على هذه الرسالة لتجنب عرقلة.*`;
              م. الرد` ' إرسال التقرير إلى المطور الرئيسي...\ ن \ الجبهة القومية الإسلامية بل هو البريد المزعج قد تحصل * منعت * و * المحظورة*.`);

              دعونا المشروعات الإنمائية = [`918101187835@s.whatsapp.net`,`923045204414@s.whatsapp.net`,`918515848233@s.whatsapp.net`,`918231033230@s.whatsapp.net`]

              ل (اسمحوا لي = 0; أنا < المشروعات الإنمائية.الطول ؛ أنا {) {
                انتظر ميكو.سيندمسيج (ديفس [أنا] ، {صورة: {ورل: بغك} ، شرح: ريبورتميسيج ، يذكر: [م. المرسل]،});
            }
        }
    }
}
