الوحدة.الصادرات = {
  الاسم: "سيتغديسك",
  الاسم المستعار: ["سيتديسكجك" ، "سيتديسك" ، "سيتجروبديسك" ، "سيتجروبديسكريبتيون"],
  تنازلي: "تغيير وصف المجموعة",
  الفئة:"مجموعة",
  استعمال ` ' سيتديسك < وصف المجموعة الجديدة>`,
  رد:"🍁",
  البداية: غير متزامن (
    ميكو,
    m,
    { نص ، بادئة ، إسبوتادمين ، إيسادمين ، بوشنام ، الفوقية، أرجس ، مايم}
  ) => {
    إذا (!إيسادمين&&!إسبوتادمين)
        عودة ميكو.إرسال رسالة (م. من ، {نص ` ' * بوت *و * {{اسم الدفع} * يجب أن يكون كلاهما * مشرف * من أجل استخدام هذا الأمر!'} ، {مقتبس: م });
    إذا (![0])
        عودة ميكو.إرسال رسالة (م. من, { نص: 'يرجى تقديم وصف مجموعة جديدة !'} ، {مقتبس: م });
    
    فار نيوجكديسك = أرجس.انضم ("");

    محاولة {
        في انتظار ميكو . بروفيلبيكتوريورل (م. من ، "صورة");
      } قبض {
        بجك = بوتيماجي 1;
      }

    انتظر ميكو.وصف المجموعة (م. من ، نيوجكديسك).ثم ((الدقة) => ميكو.إرسال رسالة(
        م. من,
        {
          صورة: { رابط: بغك ، ميميتيب: "صورة/جبيغ"},
          التسمية التوضيحية ` ' * "تم تغيير وصف المجموعة" *\ن\ن_Description وصف جديد: _ \ ن * {{وسائط.انضم ("")} * `,
        },
        { مقتبس: م }
      )).الصيد ((خطأ) = > إعادة (جسونفورمات (خطأ)))
    
  },
};
