تتطلب ("../../ التكوين.شبيبة");
تتطلب ("../../ الأساسية.شبيبة");

الوحدة.الصادرات = {
  الاسم:"منشن للكل",
  الاسم المستعار: ["منشن"،"]"],
  تنازلي:""",
  الفئة:""",
  الاستعمال:""",
  رد:"🍁",
  البداية: غير متزامن (
    ميكو,
    m,
    { النص ، البادئة ، إيسبوتادمين ، إيسادمين ، المشاركين ، أرجس }
  ) => {
    إذا (!إيسادمين)
      عودة ميكو.إرسال رسالة (م. من عند, { نص: فوضى.مستخدم} ، {مقتبس: م });

    دعونا رسالة = وسائط ? أرجس.انضم (' ' ): م.مقتبس ? م.نقلت.جي اس :' لا رسالة';

    دعونا فوضى = ' * [اجمعو هنا لو سمحتم ]*
    
*: @ * @ {{م.المرسل.انقسام ( " @") [0]}
    
* رسالة: * {{رسالة} \ ن \ ن`;

    ل (اسمحوا لي من المشاركين) {
      فوضى + = ' @ @ {{م.معرف.انقسام("@")[0]}\ن`;
    }
    فوضى + = ' \ ن \ ن * شكرا لك * \ ن`;

    انتظر ميكو.إرسال رسالة (م. من عند, { نص: فوضى, يذكر: المشاركين.خريطة (أ => a.id)} ، {مقتبس: م });
  },
};
